src/cf/Catalogs/CRM_УчетныеЗаписиМессенджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_УчетныеЗаписиМессенджеров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМессенджера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ТипыМессенджеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПросмотрСообщенийВсемПользователям</Name>
					<Comment>Разрешить просмотр сообщений всем пользователям, независимо от настройки доступа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачальнойЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ИсточникЛидов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_УказыватьПричинуОтклонения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/CRM_ТипыМессенджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_ТипыМессенджеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВКонтакте</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/CRM_УчетныеЗаписиМессенджеров/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ТипМессенджера = Перечисления.CRM_ТипыМессенджеров.ВКонтакте Тогда
		РегламентноеЗадание = Неопределено;
		Если ЗначениеЗаполнено(УникальныйИдентификаторЗадания) Тогда
			GUIDЗадания = Новый УникальныйИдентификатор(УникальныйИдентификаторЗадания);
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(GUIDЗадания);
		КонецЕсли;
		Если РегламентноеЗадание = Неопределено Тогда
			Если ЗначениеЗаполнено(ТокенГруппы) Тогда
				РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.CRM_ОжиданиеСобытийМессенджера);
				УникальныйИдентификаторЗадания = РегламентноеЗадание.УникальныйИдентификатор;
				ПараметрыЗаданияМассив = Новый Массив;
				ПараметрыСтруктура = Новый Структура;
				ПараметрыСтруктура.Вставить("УникальныйИдентификаторЗадания", УникальныйИдентификаторЗадания);
				ПараметрыСтруктура.Вставить("ТипМессенджера", ТипМессенджера);
				ПараметрыЗаданияМассив.Добавить(ПараметрыСтруктура);
				РегламентноеЗадание.Параметры = ПараметрыЗаданияМассив;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не получен токен группы. Обмен данными не доступен!'"));
			КонецЕсли;
		КонецЕсли;
		Если РегламентноеЗадание<>Неопределено Тогда
			РегламентноеЗадание.Наименование = "Ожидание событий: "+ТипМессенджера+" "+Наименование;
			РегламентноеЗадание.Использование = ЗначениеЗаполнено(ТокенГруппы);
			РегламентноеЗадание.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	УникальныйИдентификаторЗадания = "";
КонецПроцедуры
